let specialties = {
    choose: ["Оберіть спеціальність"],
    igsn: ["Музеєзнавство, пам’яткознавство","Інформаційна, бібліотечна та архівна справа", "Міжнародні відносини, суспільні комунікації та регіональні студії", "Соціальна забезпечення", "Соціологія", "Соціальна робота"],
    iarh: ["Архітектура та містобудування","Дизайн","Образотворче мистецтво, декоративне мистецтво, реставрація"],
    ibid: ["Будівництво та цивільна інженерія","Пожежна безпека","Гідротехнічне будівництво, водна інженерія та водні технології"],
    igdg: ["Геодезія та землеустрій","Науки про Землю"],
    istr: ["Екологія","Технології захисту навколишнього середовища","Цивільна безпека"," Підприємництво, торгівля та біржова діяльність","Туризм"],
    inem: ["Економіка","Облік і оподаткування","Фінанси, банківська справа та страхування","Менеджмент","Маркетинг","Міжнародні економічні відносини"],
    iesk: ["Автоматизація та комп'ютерно-інтегровані технології","Атомна енергетика","Електроенергетика,електротехніка та електромеханіка","Теплоенергетика"],
    iimt: ["Прикладна механіка","Матеріалознавство","Галузеве машинобудування","Металургія","Нафтогазова інженерія та технології","Автомобільний транспорт","Транспортні технології (на автомобільному транспорті)"],
    ikni: ["Філологія","Системний аналіз ","Комп'ютерні науки","Інформаційні системи та технології","Інженерія програмного забезпечення","Видавництво та поліграфія"],
    ikta: ["Комп’ютерні науки/Системна інженерія (Інтернет речей)","Комп’ютерна інженерія","Кібербезпека","Метрологія та інформаційно-вимірювальна техніка"],
    ippt: ["Комп’ютерні науки","Фінанси, банківська справа та страхування","Маркетинг","Облік і оподаткування"],
    iapo: ["Публічне управління та адміністрування","Хімічні технології та інженерія","Економіка (лише денна ф. н.)","Менеджмент"],
    ippo: ["Право","Психологія","Журналістика","Професійна освіта (Комп’ютерні технології)","Професійна освіта (Будівництво)","Професійна освіта (Машинобудування)","Професійна освіта (Харчові технології)","Професійна освіта (Облік і оподаткування)"],
    imfn: ["Прикладна математика","Інформатика","Прикладна фізика","Міжнародна інформація"],
    itre: ["Інформаційно-комунікаційні системи","Телекомунікаційні технології","Біомедична інженерія","Електроніка","Мікро- та наносистемна техніка"],
    ihht: ["Харчові технології","Хімічні технології та інженерія","Біотехнології та біоінженерія","Фармація, промислова фармація"]
};
let teachers = {
    choose: ["Оберіть викладача"],
    igsn: ["Прізвище викладача","Прізвище викладача","Прізвище викладача","Прізвище викладача","Прізвище викладача","Прізвище викладача"],
    iarh: ["Прізвище викладача","Прізвище викладача","Прізвище викладача","Прізвище викладача","Прізвище викладача","Прізвище викладача"],
    ibid: ["Прізвище викладача","Прізвище викладача","Прізвище викладача","Прізвище викладача","Прізвище викладача","Прізвище викладача"],
    igdg: ["Прізвище викладача","Прізвище викладача","Прізвище викладача","Прізвище викладача","Прізвище викладача","Прізвище викладача"],
    istr: ["Прізвище викладача","Прізвище викладача","Прізвище викладача","Прізвище викладача","Прізвище викладача","Прізвище викладача"],
    inem: ["Прізвище викладача","Прізвище викладача","Прізвище викладача","Прізвище викладача","Прізвище викладача","Прізвище викладача"],
    iesk: ["Прізвище викладача","Прізвище викладача","Прізвище викладача","Прізвище викладача","Прізвище викладача","Прізвище викладача"],
    iimt: ["Прізвище викладача","Прізвище викладача","Прізвище викладача","Прізвище викладача","Прізвище викладача","Прізвище викладача"],
    ikni: ["Прізвище викладача","Прізвище викладача","Прізвище викладача","Прізвище викладача","Прізвище викладача","Прізвище викладача"],
    ikta: ["Прізвище викладача","Прізвище викладача","Прізвище викладача","Прізвище викладача","Прізвище викладача","Прізвище викладача"],
    ippt: ["Прізвище викладача","Прізвище викладача","Прізвище викладача","Прізвище викладача","Прізвище викладача","Прізвище викладача"],
    iapo: ["Прізвище викладача","Прізвище викладача","Прізвище викладача","Прізвище викладача","Прізвище викладача","Прізвище викладача"],
    ippo: ["Прізвище викладача","Прізвище викладача","Прізвище викладача","Прізвище викладача","Прізвище викладача","Прізвище викладача"],
    imfn: ["Прізвище викладача","Прізвище викладача","Прізвище викладача","Прізвище викладача","Прізвище викладача","Прізвище викладача"],
    itre: ["Прізвище викладача","Прізвище викладача","Прізвище викладача","Прізвище викладача","Прізвище викладача","Прізвище викладача"],
    ihht: ["Прізвище викладача","Прізвище викладача","Прізвище викладача","Прізвище викладача","Прізвище викладача","Прізвище викладача"]

}
let institute = document.getElementById("institute");
let specialty = document.querySelector("#specialty");
let teacher = document.querySelector('#teacher');
window.onload = selectInstitute;
institute.onchange = selectInstitute;

function selectInstitute(ev){
  specialty.innerHTML = "";
  teacher.innerHTML = "";
  let c = this.value || "choose", o;
  let s = this.value || "choose", b;
  for(let i = 0; i < specialties[c].length; i++){
    o = new Option(specialties[c][i],i,false,false);
    specialty.add(o);
  };
  for(let b = 0; b < teachers[s].length; b++){
    a = new Option(teachers[s][b],b,false,false);
    teacher.add(a);
  };
}
