var cities = {
    igsn: ["Кафедра політології та міжнародних відносин", "Кафедра соціальних комунікацій та інформаційної діяльності", "Кафедра іноземних мов"],
    iarh: ["Кафедра політології та міжнародних відносин", "Кафедра соціальних комунікацій та інформаційної діяльності", "Кафедра іноземних мов"],
    ibid: ["Кафедра політології та міжнародних відносин", "Кафедра соціальних комунікацій та інформаційної діяльності", "Кафедра іноземних мов"],
    igdg: ["Кафедра політології та міжнародних відносин", "Кафедра соціальних комунікацій та інформаційної діяльності", "Кафедра іноземних мов"],
    idn: ["Кафедра політології та міжнародних відносин", "Кафедра соціальних комунікацій та інформаційної діяльності", "Кафедра іноземних мов"],
    istr: ["Кафедра політології та міжнародних відносин", "Кафедра соціальних комунікацій та інформаційної діяльності", "Кафедра іноземних мов"],
    inem: ["Кафедра політології та міжнародних відносин", "Кафедра соціальних комунікацій та інформаційної діяльності", "Кафедра іноземних мов"],
    iesk: ["Кафедра політології та міжнародних відносин", "Кафедра соціальних комунікацій та інформаційної діяльності", "Кафедра іноземних мов"],
    iimt: ["Кафедра політології та міжнародних відносин", "Кафедра соціальних комунікацій та інформаційної діяльності", "Кафедра іноземних мов"],
    ikni: ["Кафедра політології та міжнародних відносин", "Кафедра соціальних комунікацій та інформаційної діяльності", "Кафедра іноземних мов"],
    ikta: ["Кафедра політології та міжнародних відносин", "Кафедра соціальних комунікацій та інформаційної діяльності", "Кафедра іноземних мов"],
    ippt: ["Кафедра політології та міжнародних відносин", "Кафедра соціальних комунікацій та інформаційної діяльності", "Кафедра іноземних мов"],
    iaps: ["Кафедра політології та міжнародних відносин", "Кафедра соціальних комунікацій та інформаційної діяльності", "Кафедра іноземних мов"],
    ippi: ["Кафедра політології та міжнародних відносин", "Кафедра соціальних комунікацій та інформаційної діяльності", "Кафедра іноземних мов"],
    ipmf: ["Кафедра політології та міжнародних відносин", "Кафедра соціальних комунікацій та інформаційної діяльності", "Кафедра іноземних мов"],
    itre: ["Кафедра політології та міжнародних відносин", "Кафедра соціальних комунікацій та інформаційної діяльності", "Кафедра іноземних мов"],
    ihht: ["Кафедра політології та міжнародних відносин", "Кафедра соціальних комунікацій та інформаційної діяльності", "Кафедра іноземних мов"]
};
var country = document.getElementById("country");
var city = document.querySelector("#city");
window.onload = selectCountry;
country.onchange = selectCountry;

function selectCountry(ev){
    city.innerHTML = "";
    var c = this.value || "choose", o;
    for(let i=0; cities[c].lenghth; i++){
        o = new Option(cities[c][i],i,false,false);
        city.add(o);
    }
}